begin
  var a : Cardinal; // нижняя граница бозопасных показаний
  var b : Cardinal; // верхняя граница безоапсных показаний
  var n : Cardinal; // значения уровня помех
  var c : Cardinal = 0; // Счётчик безопасных показаний
  // Перемная для сохранения длины участка, где показания безопасны.
  var d : Cardinal = 0; 
  // Локальный максимум длина участка, где показания безопасны.
  var m : Cardinal;
  // Максимальная длина участка, где показания безопасны. Окончательный ответ.
  var max_len : Cardinal;
  // Ввод данных
  Console.WriteLine('Введите границы безопасности показаний');
  Console.Write('Нижняя граница: ');
  Cardinal.TryParse(Console.ReadLine(), a);
  Console.Write('Верхнияя граница: ');
  Cardinal.TryParse(Console.ReadLine(), b);
  Console.WriteLine('Введите показания датчика орбитальной станции');
  Console.WriteLine('0 - конец ввод данных');
  // Ввод первого значения уровня помех
  Cardinal.TryParse(Console.ReadLine(), n); 
  // Ввод показаний до момента, когда значение не равно 0.
  while (n <> 0) do 
  begin
    if ((n >= a) And (n <= b)) // условие безопасности показаний
    then 
       c += 1 // Увеличение счётчика безопасных показаний
    else
    begin
      d := c; // Если показания опасны, запомнить количество безопасных
      c := 0; // и сбросить счётчик.
    end;
    {определить максимальную длину участка,
     где показания безопасны.Если был сброс счётчика
     (прервана цепочка безопасных данных), то максимальной длиной
     будет старое значение счётчика (перемменая "d").
     В противном случае - текущее (новое) значение счётчика (переменное "c").}
    if (d > c) then
      m := d
    else
      m := c;
    {Максимальную длину участка, где показания безопасны. 
     *Конечнй результат}
    if(m > max_len) then
      max_len := m;
    Cardinal.TryParse(Console.ReadLine(), n); // ввод следющей порции данных
  end;
  // Вывод информации на экран.
  Console.WriteLine($'Длина интервала, где все показания безопасны: {max_len}');
  Console.Read(); // Задержка вывода на экран до нажатия клавиши "Ввод"
end.